src/DataProcessors/ПереносКонтактов/ПереносКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносКонтактов</name>
</mdclass:DataProcessor>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НетОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонтакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
</mdclass:Document>

src/DataProcessors/ПереносКонтактов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПеренос(Команда)
	
	ВыполнитьПереносНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПереносНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка,
		|	Реализация.НовыйКонтакт КАК НовыйКонтакт
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	НЕ Реализация.ПометкаУдаления
		|	И НЕ Реализация.НовыйКонтакт = """"
		|	И Реализация.Контакт = ЗНАЧЕНИЕ(Справочник.Контакты.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоПеренесено = 0;
	КоличествоНеНайдено = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Контакт = Справочники.Контакты.НайтиПоНаименованию(Выборка.НовыйКонтакт);
		
		Если НЕ ЗначениеЗаполнено(Контакт) Тогда
			КоличествоНеНайдено = КоличествоНеНайдено + 1;
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Контакт = Контакт;
		ДокументОбъект.Записать();
		
		КоличествоПеренесено = КоличествоПеренесено + 1;
		
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон(
		"Перенесено документов: %1, контакт не найден: %2.",
		КоличествоПеренесено, КоличествоНеНайдено);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
